In [1]:
import pandas as pd
import numpy as np

In [2]:
student_perf = pd.read_csv("StudentsPerformance.csv")

In [3]:
student_perf.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [4]:
student_perf.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
student_perf.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [6]:
student_perf.iloc[0:3, 0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [7]:
tit = pd.read_csv("titanic.csv")

tit.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
student_perf.loc[student_perf.gender == 'female']

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [9]:
wr_mean = student_perf['writing score'].mean()

student_perf.loc[(student_perf['writing score'] > wr_mean) & (student_perf['gender'] == 'female')]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [10]:
reduced_= student_perf.loc[(student_perf['lunch'] == 'free/reduced')]
mean_ms =  reduced_['math score'].mean()
mean_rs =  reduced_['reading score'].mean()
mean_ws =  reduced_['writing score'].mean()

standard = student_perf.loc[(student_perf['lunch'] == 'standard')]

print(standard['math score'].mean() > mean_ms)
print(standard['reading score'].mean() > mean_rs)
print(standard['writing score'].mean() > mean_ws)

print(standard['math score'].var() > reduced_['math score'].var())
print(standard['reading score'].var() > reduced_['reading score'].var())
print(standard['writing score'].var() > reduced_['writing score'].var())

True
True
True
False
False
False

In [11]:
student_perf.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [18]:
student_perf.groupby('gender', as_index=False).aggregate({'math score': 'mean', 'reading score': 'mean'}).rename(columns={'math score': 'math_score_mean'})

   gender  math_score_mean  reading score
0  female        63.633205      72.608108
1    male        68.728216      65.473029

In [ ]:
dota_data = pd.read_csv('dota_hero_stats.csv')
dota_data.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

In [31]:
dota_data.groupby(['attack_type', 'primary_attr']).nunique()

                          Unnamed: 0  id  legs  localized_name  name  roles
attack_type primary_attr
Melee       agi                   19  19     4              19    19     19
            int                    2   2     1               2     2      2
            str                   35  35     4              35    35     31
Ranged      agi                   18  18     3              18    18     16
            int                   40  40     4              40    40     33
            str                    3   3     2               3     3      3

In [26]:
dota_data.groupby('legs').nunique()

      Unnamed: 0  attack_type  id  localized_name  name  primary_attr  roles
legs
0             11            2  11              11    11             3     11
2             95            2  95              95    95             3     81
4              7            2   7               7     7             3      7
6              3            2   3               3     3             3      3
8              1            1   1               1     1             1      1

In [ ]:
acc_data = pd.read_csv('accountancy.csv')
acc_data.mean()
acc_data.groupby(['Executor', 'Type']).aggregate({'Salary': 'mean'}).sort_values('Salary', ascending=False)

                   Salary
Executor Type
Loopa    F     238.000000
         E     164.000000
Pupa     A     160.833333
Loopa    C     154.333333
Pupa     D     146.500000
Loopa    B     145.166667
         D     137.714286
Pupa     F     136.250000
         E     131.200000
         B      77.000000
         C      74.500000
Loopa    A      58.000000

In [ ]:
concentrations = pd.read_csv('algae.csv')

concentrations.groupby('genus')['alanin'].agg(['mean', 'min', 'max']).round(2).loc['Fucus']

mean    3.57
min     0.35
max     6.64
Name: Fucus, dtype: float64

In [51]:
concentrations.groupby('group').var(numeric_only=True)

        sucrose    alanin   citrate   glucose  oleic_acid
group
brown  5.459098  7.220351  5.468942  1.767756    4.385233
green  2.672626  7.059917  3.950113  0.266265    0.540388
red         NaN       NaN       NaN       NaN         NaN